---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException
source: html/bcb5841d-9dda-4aac-762b-7c618e916f23.htm
---
# RevitServerModelNameBreaksConventionException Methods

Retrieves data needed to serialize the target object.